Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetAttributeFile Method (List<String>, String)
Note: This API is now obsolete.
 Gets a file info representing the first match in the search directories.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Deprecated. Please use GetAttributeFile(string fileName) instead.",
	false)]
public static FileInfo GetAttributeFile(
	List<string> searchDirectories,
	string fileName
)
<ObsoleteAttribute("Deprecated. Please use GetAttributeFile(string fileName) instead.",
	false)>
Public Shared Function GetAttributeFile (
	searchDirectories As List(Of String),
	fileName As String
) As FileInfo
Parameters
searchDirectories
Type: System.Collections.Generic.List<String>
The list of directories to be used for searching for the file.
fileName
Type: System.String
The name of the file including the file extension.
Return Value
Type: FileInfo
A file info for the first match in the directory list. Null if no match was found.
See Also
Reference
EnvironmentFiles Class
GetAttributeFile Overload
Tekla.Structures.Dialog.UIControls Namespace